In [1]:
import numpy as np
import pandas as pd

**문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기**

In [10]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

In [11]:
df = pd.DataFrame(friend_dict_list)
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [20]:
df['총점'] = df['중간고사점수'] + df['기말고사점수']
df['평균'] = ( df['중간고사점수'] + df['기말고사점수'])/2
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [21]:
# 단순 컬럼명만 반복해서 출력
for c in df:
    print(c)

이름
중간고사점수
기말고사점수
총점
평균

In [24]:
# DataFrame에 row별 반환 해서 활용
for key, value in df.iterrows():
    print(key, ' ', value, sep="\n")

0

이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object
1

이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object
2

이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object

**문제2 : DataFrame도 반복문으로 처리 가능 평균값을 반복문(for) 활용해서 출력해 보기**

In [26]:
df['평균'] >= 90

0     True
1    False
2    False
Name: 평균, dtype: bool

**문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

In [35]:
temp =[]
for avg in df['평균']:
    if avg >= 90:
        temp.append('A')
    elif avg >= 80:
        temp.append('B')
    else:
        temp.append('F')
df['등급'] = temp

In [36]:
df
#value = 'ten' if n == 10 else 'low' if n < 10 else 'high' 중첩 삼항

     이름  중간고사점수  기말고사점수   총점    평균 등급
0  나학생1      95      85  180  90.0  A
1  나학생2      85      80  165  82.5  B
2  나학생3      10      30   40  20.0  F

     이름  중간고사점수  기말고사점수   총점    평균 grade
0  나학생1      95      85  180  90.0     A
1  나학생2      85      80  165  82.5     B
2  나학생3      10      30   40  20.0     F

**문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F가 아닌 경우 pass 값으로 반영 단 lambda 문법으로 처리해 보기**

In [48]:
# apply() : 함수 호출 및 람다식적용시  사용하는 표현
# 조건식 적용시 if 조건식이 true인 경우 처리 로직은(반환값) if 키워드 앞단에 명시

df['이수여부'] = df['grade'].apply(lambda v : 'pass' if v != 'F' else 'fail')
df

     이름  중간고사점수  기말고사점수   총점    평균 grade  이수여부
0  나학생1      95      85  180  90.0     A  pass
1  나학생2      85      80  165  82.5     B  pass
2  나학생3      10      30   40  20.0     F  fail

**문제5: apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환**

apply() 특징

1. pandas.core.series.Series 제공하는 함수
2. 람다식 적용
3. 사용자 정의 함수도 적용
4. 함수명이 parameter로 반영 또는 데이터값(단, 호출하는 함수의 parameter 로 데이터값이 적용 가능을 호출하고자 하는 함수의 parameter개수만큼  
추가로 적용 가능
5. 호출 횟수는 Serise가 보유한 row수 데이터 수 만큼 자동 호출
6. 내부 로직 : 반복 로직 포함

In [37]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [38]:
df['yyyy-mm-dd']

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [40]:
v = '2000-06-27'.split('-')
v[0]

'2000'

In [42]:
for v in df['yyyy-mm-dd']:
    print(v.split('-')[0])
    print(v[0:4])

2000
2000
2002
2002
2018
2018

In [53]:
def getyear(year):
    return int(year.split('-')[0])

In [54]:
df['year'] = df['yyyy-mm-dd'].apply(getyear)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2018-12-20  2018    2

In [51]:
def getAge(year, curr_year):
    return curr_year -year

df['age'] = df['year'].apply(getAge, curr_year=2020)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2018-12-20  2018    2

**문제 6 : gender별로 그룹화 하기**

In [56]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [57]:
gbg = df.groupby('gender')
gbg

In [58]:
gbg.size()

gender
female    6
male      5
dtype: int64

In [59]:
gbg.groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [72]:
# major
groupby_major = df.groupby('major')
[a for a in df.groupby('major').groups['Economics']]

[4, 5, 9]

In [73]:
# DataFrameGroupBy 객체를 참조하는 변수의 반복문 사용법
#key = 그룹핑된 기준 데이터 / 해당 그룹에 포함된 value값들
for key, value in groupby_major:
    print(key, ' - ', value)
    print('=' * 20)

Computer Science  -         name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
====================
Economics  -      name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
====================
Physics  -        name    major gender
2  Abraham  Physics   male
====================
Psychology  -       name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female
====================

In [79]:
for key,value in groupby_major:
    print(value)
    print('=========='*10)

       name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
====================================================================================================
    name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
====================================================================================================
      name    major gender
2  Abraham  Physics   male
====================================================================================================
     name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female
====================================================================================================

In [82]:
v = groupby_major.size()
print(v)

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [130]:
# ? 새로운 DataFrame 생성
df2 = pd.DataFrame(groupby_major.size())
df2

                  0
major
Computer Science  4
Economics         3
Physics           1
Psychology        3

In [131]:
# count 라는 컬럼명 적용
df2['count'] =  df2[0]
del df2[0]
df2

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [92]:
# index를 major값이 아닌 숫자 형식으로 적용
# reset_index() : 매우 중요
dfg = pd.DataFrame({'count':df.groupby('major').size()}).reset_index()
dfg

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [73]:
# ? 성별을 기준으로 새로운 DataFrame 생성하시고 index 재정렬 
# 결과치는 성별과 개수 즉 컬럼값, index도 새롭게 적용해 주세요

In [90]:
dfg = pd.DataFrame({'count':df.groupby('gender').size()}).reset_index()
dfg

   gender  count
0  female      6
1    male      5